app/views/products/_product.html.erb

SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 25]]
---
      <h4><%= product.name %></h4>
      <h5>overall rate: <%= number_with_precision(product.reviews.average(:rating), precision: 1) || 'N/A'%> </h5>