app/views/products/show.html.erb

          <dt>Overall Rating</dt>
          <dd><%= number_with_precision(@product.reviews.average(:rating), precision: 1)|| 'N/A'%></dd>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  ORDER BY created_at desc  [["product_id", 23]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 24]]

          <dt>reviewer:</dt>
          <dd><%= review.user.first_name %></dd>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]